{"format": "graph-model", "generatedBy": "2.2.0", "convertedBy": "TensorFlow.js Converter v1.7.4r1", "userDefinedMetadata": {"signature": {"inputs": {"input28x28:0": {"name": "input28x28:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "28"}, {"size": "28"}, {"size": "1"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "38"}]}}}}}, "modelTopology": {"node": [{"name": "input28x28", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "28"}, {"size": "28"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ExResModel/block0_conv/separable_conv2d_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ExResModel/block0_conv/separable_conv2d_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ExResModel/block10_conv_residual0/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "40"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ExResModel/block10_conv_residual0/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "40"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ExResModel/block11_conv1/separable_conv2d_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "40"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ExResModel/block11_conv1/separable_conv2d_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "40"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ExResModel/block20_conv_residual1/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "40"}, {"size": "60"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ExResModel/block20_conv_residual1/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "60"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ExResModel/block11_conv2/separable_conv2d_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "40"}, {"size": "40"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ExResModel/block11_conv2/separable_conv2d_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "40"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ExResModel/block20_conv_residual0/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "40"}, {"size": "60"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ExResModel/block20_conv_residual0/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "60"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ExResModel/block21_conv1/separable_conv2d_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "40"}, {"size": "60"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ExResModel/block21_conv1/separable_conv2d_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "60"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ExResModel/block30_conv_residual1/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "60"}, {"size": "90"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ExResModel/block30_conv_residual1/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "90"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ExResModel/block21_conv2/separable_conv2d_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "60"}, {"size": "60"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ExResModel/block21_conv2/separable_conv2d_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "60"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ExResModel/block30_conv_residual0/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "60"}, {"size": "90"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ExResModel/block30_conv_residual0/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "90"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ExResModel/block31_conv1/separable_conv2d_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "60"}, {"size": "90"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ExResModel/block31_conv1/separable_conv2d_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "90"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ExResModel/block31_conv2/separable_conv2d_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "90"}, {"size": "90"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ExResModel/block31_conv2/separable_conv2d_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "90"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ExResModel/block31_conv1_act/Neg", "op": "Const", "input": ["^input28x28"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "90"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/ExResModel/average/truediv_recip", "op": "Const", "input": ["^input28x28"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ExResModel/block21_conv1_act/Neg", "op": "Const", "input": ["^input28x28"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}, {"size": "8"}, {"size": "60"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ExResModel/block11_conv1_act/Neg", "op": "Const", "input": ["^input28x28"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "13"}, {"size": "13"}, {"size": "40"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ExResModel/block0_conv_act/Neg", "op": "Const", "input": ["^input28x28"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "13"}, {"size": "13"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_2", "op": "Const", "input": ["^input28x28"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_13", "op": "Const", "input": ["^input28x28"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_20", "op": "Const", "input": ["^input28x28"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "40"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_35", "op": "Const", "input": ["^input28x28"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "40"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_42", "op": "Const", "input": ["^input28x28"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "60"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_62", "op": "Const", "input": ["^input28x28"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "60"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_69", "op": "Const", "input": ["^input28x28"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "90"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ExResModel/block31_ZeroPadding/Pad/paddings", "op": "Const", "input": ["^input28x28"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ExResModel/global_avg_pool/Mean/reduction_indices", "op": "Const", "input": ["^input28x28"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_85", "op": "Const", "input": ["^input28x28"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "90"}, {"size": "38"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_86", "op": "Const", "input": ["^input28x28"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "38"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ExResModel/block20_noise_bn/FusedBatchNormV3/Scaled", "op": "Const", "input": ["^input28x28"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "40"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ExResModel/block20_noise_bn/FusedBatchNormV3/Offset", "op": "Const", "input": ["^input28x28"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "40"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ExResModel/block10_noise_bn/FusedBatchNormV3/Scaled", "op": "Const", "input": ["^input28x28"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ExResModel/block10_noise_bn/FusedBatchNormV3/Offset", "op": "Const", "input": ["^input28x28"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ExResModel/block30_noise_bn/FusedBatchNormV3/Scaled", "op": "Const", "input": ["^input28x28"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "60"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ExResModel/block30_noise_bn/FusedBatchNormV3/Offset", "op": "Const", "input": ["^input28x28"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "60"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ExResModel/block0_conv/separable_conv2d/depthwise", "op": "DepthwiseConv2dNative", "input": ["input28x28", "Func/StatefulPartitionedCall/input/_2"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/ExResModel/block0_conv_bn/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/ExResModel/block0_conv/separable_conv2d/depthwise", "StatefulPartitionedCall/ExResModel/block0_conv/separable_conv2d_weights", "StatefulPartitionedCall/ExResModel/block0_conv/separable_conv2d_bn_offset", "StatefulPartitionedCall/ExResModel/block0_conv_act/Neg"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "2"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UHJlbHU="]}}}}, {"name": "StatefulPartitionedCall/ExResModel/block10_ZeroPadding_residual0/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/ExResModel/block0_conv_bn/FusedBatchNormV3", "StatefulPartitionedCall/ExResModel/block31_ZeroPadding/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ExResModel/block10_noise_bn/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/ExResModel/block0_conv_bn/FusedBatchNormV3", "StatefulPartitionedCall/ExResModel/block10_noise_bn/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ExResModel/block10_conv_residual0_bn/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/ExResModel/block10_ZeroPadding_residual0/Pad", "StatefulPartitionedCall/ExResModel/block10_conv_residual0/Conv2D_weights", "StatefulPartitionedCall/ExResModel/block10_conv_residual0/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/ExResModel/block10_noise_bn/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/ExResModel/block10_noise_bn/FusedBatchNormV3/Mul", "StatefulPartitionedCall/ExResModel/block10_noise_bn/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ExResModel/block20_ZeroPadding_residual1/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/ExResModel/block10_conv_residual0_bn/FusedBatchNormV3", "StatefulPartitionedCall/ExResModel/block31_ZeroPadding/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ExResModel/block11_conv1/separable_conv2d/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/ExResModel/block10_noise_bn/FusedBatchNormV3", "Func/StatefulPartitionedCall/input/_13"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/ExResModel/block20_conv_residual1_bn/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/ExResModel/block20_ZeroPadding_residual1/Pad", "StatefulPartitionedCall/ExResModel/block20_conv_residual1/Conv2D_weights", "StatefulPartitionedCall/ExResModel/block20_conv_residual1/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/ExResModel/block11_conv1_bn/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/ExResModel/block11_conv1/separable_conv2d/depthwise", "StatefulPartitionedCall/ExResModel/block11_conv1/separable_conv2d_weights", "StatefulPartitionedCall/ExResModel/block11_conv1/separable_conv2d_bn_offset", "StatefulPartitionedCall/ExResModel/block11_conv1_act/Neg"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "2"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UHJlbHU="]}}}}, {"name": "StatefulPartitionedCall/ExResModel/block11_conv2/separable_conv2d/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/ExResModel/block11_conv1_bn/FusedBatchNormV3", "Func/StatefulPartitionedCall/input/_20"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/ExResModel/block11_conv2_bn/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/ExResModel/block11_conv2/separable_conv2d/depthwise", "StatefulPartitionedCall/ExResModel/block11_conv2/separable_conv2d_weights", "StatefulPartitionedCall/ExResModel/block11_conv2/separable_conv2d_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/ExResModel/block11_ZeroPadding/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/ExResModel/block11_conv2_bn/FusedBatchNormV3", "StatefulPartitionedCall/ExResModel/block31_ZeroPadding/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ExResModel/block11_pool/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/ExResModel/block11_ZeroPadding/Pad"], "attr": {"ksize": {"list": {"i": ["1", "3", "3", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/ExResModel/block10_add_residuals/add", "op": "AddV2", "input": ["StatefulPartitionedCall/ExResModel/block10_conv_residual0_bn/FusedBatchNormV3", "StatefulPartitionedCall/ExResModel/block11_pool/MaxPool"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ExResModel/block20_noise_bn/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/ExResModel/block10_add_residuals/add", "StatefulPartitionedCall/ExResModel/block20_noise_bn/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ExResModel/block20_ZeroPadding_residual0/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/ExResModel/block10_add_residuals/add", "StatefulPartitionedCall/ExResModel/block31_ZeroPadding/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ExResModel/block20_noise_bn/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/ExResModel/block20_noise_bn/FusedBatchNormV3/Mul", "StatefulPartitionedCall/ExResModel/block20_noise_bn/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ExResModel/block20_conv_residual0_bn/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/ExResModel/block20_ZeroPadding_residual0/Pad", "StatefulPartitionedCall/ExResModel/block20_conv_residual0/Conv2D_weights", "StatefulPartitionedCall/ExResModel/block20_conv_residual0/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/ExResModel/block21_conv1/separable_conv2d/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/ExResModel/block20_noise_bn/FusedBatchNormV3", "Func/StatefulPartitionedCall/input/_35"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/ExResModel/average/add", "op": "AddV2", "input": ["StatefulPartitionedCall/ExResModel/block20_conv_residual0_bn/FusedBatchNormV3", "StatefulPartitionedCall/ExResModel/block20_conv_residual1_bn/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ExResModel/block21_conv1_bn/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/ExResModel/block21_conv1/separable_conv2d/depthwise", "StatefulPartitionedCall/ExResModel/block21_conv1/separable_conv2d_weights", "StatefulPartitionedCall/ExResModel/block21_conv1/separable_conv2d_bn_offset", "StatefulPartitionedCall/ExResModel/block21_conv1_act/Neg"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "2"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UHJlbHU="]}}}}, {"name": "StatefulPartitionedCall/ExResModel/average/truediv", "op": "Mul", "input": ["ConstantFolding/StatefulPartitionedCall/ExResModel/average/truediv_recip", "StatefulPartitionedCall/ExResModel/average/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ExResModel/block30_ZeroPadding_residual1/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/ExResModel/average/truediv", "StatefulPartitionedCall/ExResModel/block31_ZeroPadding/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ExResModel/block30_conv_residual1_bn/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/ExResModel/block30_ZeroPadding_residual1/Pad", "StatefulPartitionedCall/ExResModel/block30_conv_residual1/Conv2D_weights", "StatefulPartitionedCall/ExResModel/block30_conv_residual1/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/ExResModel/block21_conv2/separable_conv2d/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/ExResModel/block21_conv1_bn/FusedBatchNormV3", "Func/StatefulPartitionedCall/input/_42"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/ExResModel/block21_conv2_bn/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/ExResModel/block21_conv2/separable_conv2d/depthwise", "StatefulPartitionedCall/ExResModel/block21_conv2/separable_conv2d_weights", "StatefulPartitionedCall/ExResModel/block21_conv2/separable_conv2d_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/ExResModel/block21_ZeroPadding/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/ExResModel/block21_conv2_bn/FusedBatchNormV3", "StatefulPartitionedCall/ExResModel/block31_ZeroPadding/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ExResModel/block21_pool/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/ExResModel/block21_ZeroPadding/Pad"], "attr": {"ksize": {"list": {"i": ["1", "3", "3", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/ExResModel/block20_add_residuals/add", "op": "AddV2", "input": ["StatefulPartitionedCall/ExResModel/average/truediv", "StatefulPartitionedCall/ExResModel/block21_pool/MaxPool"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ExResModel/block30_ZeroPadding_residual0/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/ExResModel/block20_add_residuals/add", "StatefulPartitionedCall/ExResModel/block31_ZeroPadding/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ExResModel/block30_noise_bn/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/ExResModel/block20_add_residuals/add", "StatefulPartitionedCall/ExResModel/block30_noise_bn/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ExResModel/block30_conv_residual0_bn/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/ExResModel/block30_ZeroPadding_residual0/Pad", "StatefulPartitionedCall/ExResModel/block30_conv_residual0/Conv2D_weights", "StatefulPartitionedCall/ExResModel/block30_conv_residual0/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/ExResModel/block30_noise_bn/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/ExResModel/block30_noise_bn/FusedBatchNormV3/Mul", "StatefulPartitionedCall/ExResModel/block30_noise_bn/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ExResModel/average_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/ExResModel/block30_conv_residual0_bn/FusedBatchNormV3", "StatefulPartitionedCall/ExResModel/block30_conv_residual1_bn/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ExResModel/block31_conv1/separable_conv2d/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/ExResModel/block30_noise_bn/FusedBatchNormV3", "Func/StatefulPartitionedCall/input/_62"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/ExResModel/average_1/truediv", "op": "Mul", "input": ["ConstantFolding/StatefulPartitionedCall/ExResModel/average/truediv_recip", "StatefulPartitionedCall/ExResModel/average_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ExResModel/block31_conv1_bn/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/ExResModel/block31_conv1/separable_conv2d/depthwise", "StatefulPartitionedCall/ExResModel/block31_conv1/separable_conv2d_weights", "StatefulPartitionedCall/ExResModel/block31_conv1/separable_conv2d_bn_offset", "StatefulPartitionedCall/ExResModel/block31_conv1_act/Neg"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "2"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UHJlbHU="]}}}}, {"name": "StatefulPartitionedCall/ExResModel/block31_conv2/separable_conv2d/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/ExResModel/block31_conv1_bn/FusedBatchNormV3", "Func/StatefulPartitionedCall/input/_69"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/ExResModel/block31_conv2_bn/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/ExResModel/block31_conv2/separable_conv2d/depthwise", "StatefulPartitionedCall/ExResModel/block31_conv2/separable_conv2d_weights", "StatefulPartitionedCall/ExResModel/block31_conv2/separable_conv2d_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/ExResModel/block31_ZeroPadding/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/ExResModel/block31_conv2_bn/FusedBatchNormV3", "StatefulPartitionedCall/ExResModel/block31_ZeroPadding/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ExResModel/block31_pool/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/ExResModel/block31_ZeroPadding/Pad"], "attr": {"ksize": {"list": {"i": ["1", "3", "3", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/ExResModel/block30_add_residuals/add", "op": "AddV2", "input": ["StatefulPartitionedCall/ExResModel/average_1/truediv", "StatefulPartitionedCall/ExResModel/block31_pool/MaxPool"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ExResModel/global_avg_pool/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/ExResModel/block30_add_residuals/add", "StatefulPartitionedCall/ExResModel/global_avg_pool/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ExResModel/output/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/ExResModel/global_avg_pool/Mean", "Func/StatefulPartitionedCall/input/_85", "Func/StatefulPartitionedCall/input/_86"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/ExResModel/output/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/ExResModel/output/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/ExResModel/output/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "versions": {"producer": 175}}, "weightsManifest": [{"paths": ["mrz20210831.bin"], "weights": [{"name": "StatefulPartitionedCall/ExResModel/block0_conv/separable_conv2d_weights", "shape": [1, 1, 1, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ExResModel/block0_conv/separable_conv2d_bn_offset", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ExResModel/block10_conv_residual0/Conv2D_weights", "shape": [1, 1, 32, 40], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ExResModel/block10_conv_residual0/Conv2D_bn_offset", "shape": [40], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ExResModel/block11_conv1/separable_conv2d_weights", "shape": [1, 1, 32, 40], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ExResModel/block11_conv1/separable_conv2d_bn_offset", "shape": [40], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ExResModel/block20_conv_residual1/Conv2D_weights", "shape": [1, 1, 40, 60], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ExResModel/block20_conv_residual1/Conv2D_bn_offset", "shape": [60], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ExResModel/block11_conv2/separable_conv2d_weights", "shape": [1, 1, 40, 40], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ExResModel/block11_conv2/separable_conv2d_bn_offset", "shape": [40], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ExResModel/block20_conv_residual0/Conv2D_weights", "shape": [1, 1, 40, 60], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ExResModel/block20_conv_residual0/Conv2D_bn_offset", "shape": [60], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ExResModel/block21_conv1/separable_conv2d_weights", "shape": [1, 1, 40, 60], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ExResModel/block21_conv1/separable_conv2d_bn_offset", "shape": [60], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ExResModel/block30_conv_residual1/Conv2D_weights", "shape": [1, 1, 60, 90], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ExResModel/block30_conv_residual1/Conv2D_bn_offset", "shape": [90], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ExResModel/block21_conv2/separable_conv2d_weights", "shape": [1, 1, 60, 60], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ExResModel/block21_conv2/separable_conv2d_bn_offset", "shape": [60], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ExResModel/block30_conv_residual0/Conv2D_weights", "shape": [1, 1, 60, 90], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ExResModel/block30_conv_residual0/Conv2D_bn_offset", "shape": [90], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ExResModel/block31_conv1/separable_conv2d_weights", "shape": [1, 1, 60, 90], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ExResModel/block31_conv1/separable_conv2d_bn_offset", "shape": [90], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ExResModel/block31_conv2/separable_conv2d_weights", "shape": [1, 1, 90, 90], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ExResModel/block31_conv2/separable_conv2d_bn_offset", "shape": [90], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ExResModel/block31_conv1_act/Neg", "shape": [5, 5, 90], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/ExResModel/average/truediv_recip", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ExResModel/block21_conv1_act/Neg", "shape": [8, 8, 60], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ExResModel/block11_conv1_act/Neg", "shape": [13, 13, 40], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ExResModel/block0_conv_act/Neg", "shape": [13, 13, 32], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_2", "shape": [3, 3, 1, 1], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_13", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_20", "shape": [3, 3, 40, 1], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_35", "shape": [3, 3, 40, 1], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_42", "shape": [3, 3, 60, 1], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_62", "shape": [3, 3, 60, 1], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_69", "shape": [3, 3, 90, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ExResModel/block31_ZeroPadding/Pad/paddings", "shape": [4, 2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/ExResModel/global_avg_pool/Mean/reduction_indices", "shape": [2], "dtype": "int32"}, {"name": "Func/StatefulPartitionedCall/input/_85", "shape": [90, 38], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_86", "shape": [38], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ExResModel/block20_noise_bn/FusedBatchNormV3/Scaled", "shape": [40], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ExResModel/block20_noise_bn/FusedBatchNormV3/Offset", "shape": [40], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ExResModel/block10_noise_bn/FusedBatchNormV3/Scaled", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ExResModel/block10_noise_bn/FusedBatchNormV3/Offset", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ExResModel/block30_noise_bn/FusedBatchNormV3/Scaled", "shape": [60], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ExResModel/block30_noise_bn/FusedBatchNormV3/Offset", "shape": [60], "dtype": "float32"}]}]}